In [19]:
import pandas as pd
data = [ [ 2000, 3050, 2050, 1980], [ 7500, 2050, 2050, 1980], [15450, 15050, 15550, 14900]]

In [20]:
DF2 = pd.DataFrame(data, columns = ["시가", "고가", "저가", "종가"])
DF2

      시가     고가     저가     종가
0   2000   3050   2050   1980
1   7500   2050   2050   1980
2  15450  15050  15550  14900

In [21]:
print(DF2.columns)
print(DF2.index)

Index(['시가', '고가', '저가', '종가'], dtype='object')
RangeIndex(start=0, stop=3, step=1)

In [22]:
DF2.index = ["2024-01-01", "2024-02-01", "2024-03-01"]
DF2

               시가     고가     저가     종가
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [23]:
DF2.columns = ["Open", "High", "Low", "Close"]
DF2

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [28]:
print(DF2.iloc[1][["High", "Close"]])

High     2050
Close    1980
Name: 2024-02-01, dtype: int64

In [31]:
DF2.loc["2024-04-01"] = [3200, 3550, 3000, 2990]
DF2

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [32]:
DF2.drop("2024-01-01", axis = 0, inplace = True)
DF2

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [38]:
DF2.iloc[1, 2] = 14000
DF2

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  14000  14900
2024-04-01   3200   3550   3000   2990

In [40]:
DF2["Average"] = 0
DF2

             Open   High    Low  Close  Average
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  14000  14900        0
2024-04-01   3200   3550   3000   2990        0

In [47]:
DF2.loc["Total"] = 0
DF2

             Open   High    Low  Close  Average
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  14000  14900        0
2024-04-01   3200   3550   3000   2990        0
Total           0      0      0      0        0